validation/solid/fullCell/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

psiChemistryModel   ODEChemistryModel<constGasThermoPhysics>;

chemistryType
{
    chemistrySolver   EulerImplicit;
    chemistryThermo   psi;
}

chemistry           off;

chemistrySolver     ode;

initialChemicalTimeStep 1e-7;

sequentialCoeffs
{
    cTauChem        0.001;
}

EulerImplicitCoeffs
{
    cTauChem        0.05;
    equilibriumRateLimiter off;
}

odeCoeffs
{
    solver          SIBS;
    eps             0.05;
    scale           1;
}

// ************************************************************************* //
